Revit 2026 API

# KeyBasedTreeEntry Properties

---

The KeyBasedTreeEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Key | The key of this entry. |
|  | ParentKey | The parent key of this entry. |

#### Reference

KeyBasedTreeEntry Class

Autodesk.Revit.DB Namespace